var arrayHospital = [
    // 中原区（9）
    {"position": "113.694456,34.773166", "name": "河南省人民医院"},
    {"position": "113.674349,34.759027", "name": "河南医学院第一附属医院"},
    {"position": "113.611554,34.713103", "name": "河南弘大心血管病医院"},
    {"position": "115.074249,35.771792", "name": "中原油田总医院"},
    {"position": "113.535157,34.764727", "name": "中国人民解放军第一五三中心医院"},
    {"position": "113.612158,34.750228", "name": "郑州市中心医院"},
    {"position": "113.644696,34.753408", "name": "郑州大学男科医院"},
    {"position": "113.671158,34.786655", "name": "郑州希褔中医肿瘤医院"},
    {"position": "113.615252,34.743020", "name": "郑州协和医院"},
    // 金水区（9）
    {"position": "113.254978,23.142424", "name": "河南军区总医院"},
    {"position": "113.674349,34.759027", "name": "河南中医学院第一附属医院"},
    {"position": "113.673609,34.765609", "name": "河南省军区医院"},
    {"position": "113.650617,34.801298", "name": "河南省中医院"},
    {"position": "113.702006,34.771055", "name": "河南省肿瘤医院"},
    {"position": "113.682564,34.780134", "name": "郑州同济医院"},
    {"position": "113.753724,34.778674", "name": "郑州市儿童医院"},
    {"position": "113.646073,34.752872", "name": "郑州大学第一附属医院"},
    {"position": "113.670255,34.766074", "name": "郑州大学第二附属医院"},
    // 二七区（4）
    {"position": "113.647984,34.743302", "name": "郑州大学第三附属医院"},
    {"position": "113.740287,34.721732", "name": "郑州中医骨伤病医院"},
    {"position": "113.651673,34.743464", "name": "郑州大学第五附属医院"},
    {"position": "113.637374,34.737471", "name": "郑州市骨科医院"},
    {"position": "113.617272,34.75198", "name": "郑州市红十字医院"},
    // 管城区（1）
    {"position": "113.740893,34.749114", "name": "郑州市管城中医院肿瘤科"},
    // 新郑市（1）
    {"position": "113.70328,34.606088", "name": "新郑博爱医院"}

];

/**
 * http://lbs.amap.com/console/show/picker
 */
