/**
 *
 * @line {[0,'换乘'],[1..20,'线路']}
 * @state{[0,'规划'],[1,'修建'],[2,'运行']}
 */
var arrayMetro = [
    // LINE 01
    {"line": 1, "position": "113.542069, 34.826573", "state": 2, "name": "河南工业大学"},
    {"line": 1, "position": "113.541812, 34.816778", "state": 2, "name": "郑大科技园"},
    {"line": 1, "position": "113.541431, 34.807587", "state": 2, "name": "郑州大学"},
    {"line": 1, "position": "113.540879, 34.794425", "state": 2, "name": "梧桐街"},
    {"line": 1, "position": "113.541007, 34.783446", "state": 2, "name": "兰寨"},
    {"line": 1, "position": "113.540747, 34.768136", "state": 2, "name": "铁炉"},
    {"line": 1, "position": "113.553922, 34.762068", "state": 2, "name": "市民中心"},
    {"line": 1, "position": "113.570155, 34.761138", "state": 2, "name": "西流湖"},
    {"line": 1, "position": "113.588179, 34.760212", "state": 2, "name": "西三环"},
    {"line": 1, "position": "113.603285, 34.756793", "state": 2, "name": "秦岭路"},
    {"line": 0, "position": "113.614293, 34.755806", "state": 2, "name": "五一公园"},
    {"line": 1, "position": "113.624271, 34.755066", "state": 2, "name": "碧沙岗"},
    {"line": 1, "position": "113.633519, 34.747485", "state": 2, "name": "绿城广场"},
    {"line": 1, "position": "113.642574, 34.747555", "state": 2, "name": "医学院"},
    {"line": 1, "position": "113.656157, 34.746709", "state": 2, "name": "郑州火车站"},
    {"line": 1, "position": "113.665834, 34.752523", "state": 2, "name": "二七广场"},
    {"line": 1, "position": "113.673865, 34.757573", "state": 2, "name": "人民路"},
    {"line": 0, "position": "113.682051, 34.762183", "state": 2, "name": "紫荆山"},
    {"line": 1, "position": "113.703396, 34.763386", "state": 2, "name": "燕庄"},
    {"line": 1, "position": "113.715825, 34.763951", "state": 2, "name": "民航路"},
    {"line": 1, "position": "113.725744, 34.766731", "state": 2, "name": "会展中心"},
    {"line": 1, "position": "113.744514, 34.762888", "state": 2, "name": "黄河南路"},
    {"line": 1, "position": "113.755313, 34.765431", "state": 2, "name": "农业南路"},
    {"line": 1, "position": "113.766626, 34.764418", "state": 2, "name": "东风南路"},
    {"line": 0, "position": "113.777012, 34.759253", "state": 2, "name": "郑州东站"},
    {"line": 1, "position": "113.792537, 34.759967", "state": 2, "name": "博学路"},
    {"line": 1, "position": "113.810404, 34.773134", "state": 2, "name": "市体育中心"},
    {"line": 1, "position": "113.810499, 34.792727", "state": 2, "name": "龙子湖"},
    {"line": 1, "position": "113.812188, 34.808444", "state": 2, "name": "文苑北路"},
    {"line": 1, "position": "113.812639, 34.820661", "state": 2, "name": "河南大学新区(暂缓开通)"},
    // LINE 02
    {"line": 2, "position": "113.592243,34.86722", "state": 1, "name": "天山路"},
    {"line": 2, "position": "113.613652,34.865908", "state": 1, "name": "古树苑"},
    {"line": 2, "position": "113.626312,34.866533", "state": 1, "name": "金河路"},
    {"line": 2, "position": "113.644603,34.867235", "state": 1, "name": "黄河迎宾馆"},
    {"line": 2, "position": "113.662671,34.866918", "state": 1, "name": "田园路"},
    {"line": 2, "position": "113.679259,34.862739", "state": 1, "name": "金达街"},
    {"line": 2, "position": "113.678969,34.843757", "state": 2, "name": "刘庄"},
    {"line": 2, "position": "113.681255,34.828435", "state": 2, "name": "柳林"},
    {"line": 2, "position": "113.681662,34.819451", "state": 2, "name": "沙门"},
    {"line": 2, "position": "113.681501,34.804978", "state": 2, "name": "北三环"},
    {"line": 2, "position": "113.681625,34.795856", "state": 2, "name": "东风路"},
    {"line": 2, "position": "113.681662,34.789133", "state": 2, "name": "关虎屯"},
    {"line": 0, "position": "113.682049,34.773919", "state": 2, "name": "黄河路"},
    // {"line": 2, "position": "113.682049,34.762184", "state": 2, "name": "紫荆山"},
    {"line": 2, "position": "113.682027,34.747543", "state": 2, "name": "东大街"},
    {"line": 2, "position": "113.682043,34.738229", "state": 2, "name": "陇海东路"},
    {"line": 2, "position": "113.682059,34.728896", "state": 2, "name": "二里岗"},
    {"line": 2, "position": "113.681163,34.720316", "state": 2, "name": "南五里堡"},
    {"line": 2, "position": "113.682236,34.705963", "state": 2, "name": "花寨"},
    {"line": 2, "position": "113.682295,34.698849", "state": 2, "name": "南三环"},
    {"line": 2, "position": "113.682429,34.684338", "state": 2, "name": "站马屯"},
    {"line": 0, "position": "113.681872,34.662769", "state": 2, "name": "南四环"},

    // LINE 03
    {"line": 0, "position": "113.649887,34.774149", "state": 0, "name": "南阳路"},

    // LINE 04
    {"line": 0, "position": "113.721991,34.720964", "state": 1, "name": "七里河"},

    // LINE 05
    // {"line": 5, "position": "113.681163,34.720316", "state": 2, "name": "南五里堡"},
    {"line": 5, "position": "113.690394,34.720841", "state": 1, "name": "弓庄"},
    // {"line": 5, "position": "113.721991,34.720964", "state": 2, "name": "七里河"},
    {"line": 5, "position": "113.746924,34.720982", "state": 1, "name": "鲍湖"},
    {"line": 5, "position": "113.773811,34.727084", "state": 1, "name": "李南岗"},
    {"line": 5, "position": "113.773768,34.751241", "state": 1, "name": "榆林"},
    //{"line": 5, "position": "113.777012, 34.759253", "state": 2, "name": "郑州东站"},
    {"line": 5, "position": "113.770721,34.769363", "state": 1, "name": "金庄"},
    {"line": 5, "position": "113.767009,34.776607", "state": 1, "name": "祭城"},
    {"line": 5, "position": "113.751237,34.776184", "state": 1, "name": "市儿童医院"},
    {"line": 5, "position": "113.729587,34.778846", "state": 1, "name": "湿地公园"},
    {"line": 5, "position": "113.718836,34.776237", "state": 1, "name": "众意西路"},
    {"line": 0, "position": "113.708392,34.774713", "state": 1, "name": "姚寨"},
    {"line": 5, "position": "113.692588,34.774651", "state": 1, "name": "省人民医院"},
    // {"line": 5, "position": "113.682049,34.773919", "state": 2, "name": "黄河路"},
    {"line": 5, "position": "113.666839,34.774598", "state": 1, "name": "郑州人民医院"},
    // {"line": 5, "position": "113.649887,34.774149", "state": 2, "name": "南阳路"},
    {"line": 5, "position": "113.622702,34.765758", "state": 1, "name": "月季公园"},
    // {"line": 5, "position": "113.614293, 34.755806", "state": 2, "name": "五一公园"},
    {"line": 5, "position": "113.613593,34.747463", "state": 1, "name": "市中心医院"},
    {"line": 5, "position": "113.628093,34.720395", "state": 1, "name": "齐礼闫"},
    {"line": 5, "position": "113.643988,34.720377", "state": 1, "name": "市第二人民医院"},
    {"line": 5, "position": "113.657146,34.720425", "state": 1, "name": "京广南路"},
    {"line": 5, "position": "113.668197,34.720381", "state": 1, "name": "冯庄"},

    // LINE 06
    // LINE 07
    // LINE 08
    // LINE 09
    // {"line": 9, "position": "113.681872,34.662769", "state": 2, "name": "南四环"},
    {"line": 9, "position": "113.683706,34.647845", "state": 2, "name": "十八里河"},
    {"line": 9, "position": "113.681577,34.626823", "state": 2, "name": "沙窝李"},
    {"line": 9, "position": "113.682987,34.611495", "state": 2, "name": "双湖大道"},
    {"line": 9, "position": "113.725661,34.594093", "state": 2, "name": "华南城西"},
    {"line": 9, "position": "113.748879,34.594093", "state": 2, "name": "华南城"},
    {"line": 9, "position": "113.774223,34.594018", "state": 2, "name": "华南城东"},
    {"line": 9, "position": "113.818278,34.585778", "state": 2, "name": "孟庄"},
    {"line": 9, "position": "113.837892,34.584882", "state": 2, "name": "港区北"},
    {"line": 9, "position": "113.853137,34.584776", "state": 2, "name": "康平湖"},
    {"line": 9, "position": "113.859682,34.575863", "state": 2, "name": "兰河公园"},
    {"line": 9, "position": "113.859676,34.567441", "state": 2, "name": "恩平湖"},
    {"line": 9, "position": "113.857198,34.549345", "state": 2, "name": "综合保税区"},
    {"line": 9, "position": "113.852466,34.526039", "state": 2, "name": "新郑机场"},

    // LINE 10
    // LINE 11
    // LINE 12
    // LINE 13
    // LINE 14
    // LINE 15
    // LINE 16
    // LINE 17
];

/**
 * http://lbs.amap.com/console/show/picker
 */
var EDGE_W = 113.947000; // 经度
var EDGE_E = 114.124500; // 经度
var EDGE_S = 33.536000; // 纬度
var EDGE_N = 33.618000; // 纬度

/**
 * 郑州环城路
 */
var arrayZhengzhouEdge = [
    [EDGE_W, EDGE_N], // 左上
    [EDGE_E, EDGE_N], // 右上
    [EDGE_E, EDGE_S], // 右下
    [EDGE_W, EDGE_S], // 左下
    [EDGE_W, EDGE_N]  // 左上
];

/**
 * 一号线
 * @type {[*]}
 */
var arraySubway01 = [
    [113.542069, 34.826573], // 河南工业大学
    [113.541812, 34.816778], // 郑大科技园
    [113.541431, 34.807587], // 郑州大学
    [113.540879, 34.794425], // 梧桐街
    [113.541007, 34.783446], // 兰寨
    [113.540747, 34.768136], // 铁炉
    [113.553922, 34.762068], // 市民中心
    [113.570155, 34.761138], // 西流湖
    [113.588179, 34.760212], // 西三环
    [113.603285, 34.756793], // 秦岭路
    [113.614293, 34.755806], // 五一公园
    [113.624271, 34.755066], // 碧沙岗
    [113.633519, 34.747485], // 绿城广场
    [113.642574, 34.747555], // 医学院
    [113.656157, 34.746709], // 郑州火车站
    [113.665834, 34.752523], // 二七广场
    [113.673865, 34.757573], // 人民路
    [113.682051, 34.762183], // 紫荆山
    [113.703396, 34.763386], // 燕庄
    [113.715825, 34.763951], // 民航路
    [113.725744, 34.766731], // 会展中心
    [113.744514, 34.762888], // 黄河南路
    [113.755313, 34.765431], // 农业南路
    [113.766626, 34.764418], // 东风南路
    [113.777012, 34.759253], // 郑州东站
    [113.792537, 34.759967], // 博学路
    [113.810404, 34.773134], // 市体育中心
    [113.810499, 34.792727], // 龙子湖
    [113.812188, 34.808444], // 文苑北路
    [113.812639, 34.820661] // 河南大学新区(暂缓开通)
]


/**
 * 二号线
 * @type {[*]}
 */
var arraySubway02 = []
