/**
 * 漯河房管局>市场信息>商品房信息>输入预售证号查询：销控表
 *
 * @wz { 位置 }
 * @mc { 名称 }
 * @hx { 户型 }
 * @zx { 装修:0-毛坯,1-精装 }
 * @rj { 容积率 }
 * @cw { 车位/户数 }
 * @nd { 年代 }
 * @jg { 价格 }
 * @bz { 备注 }
 */
var arrayHouse = [
    // A
    // B
    {
        "wz": "113.594167,34.746224",
        "mc": "保利心语（中原区）",
        "hx": 1234,
        "zx": 1,
        "rj": 2.99,
        "cw": "1161/1889",
        "nd": 2015,
        "jg": 16000,
        "bz": "94*精装"
    },
    {
        "wz": "113.584117,34.778751",
        "mc": "碧桂园西湖（中原区）",
        "hx": 34,
        "zx": 1,
        "rj": 2.99,
        "cw": "1449/1500",
        "nd": 2017,
        "jg": 0,
        "bz": "预计2020年上半年交房"
    },
    // C
    // D
    {
        "wz": "113.738942,34.752298",
        "mc": "鼎天東尚（郑东新区）",
        "hx": 234,
        "zx": 0,
        "rj": 3.99,
        "cw": "0/1022",
        "nd": 2017,
        "jg": 21000,
        "bz": "高层主要在售户型建面83-135平米，均价21000元/平米。"
    },
    {
        "wz": "113.897611,34.730655",
        "mc": "东润城（白沙绿博）",
        "hx": 2345,
        "zx": 1,
        "rj": 2.60,
        "cw": "1127/1123",
        "nd": 2017,
        "jg": 21000,
        "bz": "三期高层在售房源包含建面约95㎡、112㎡非毛坯三房，均价12000元/㎡。"
    },
    {
        "wz": "113.62656,34.671054",
        "mc": "东原晴天见（二七区）",
        "hx": 2345,
        "zx": 0,
        "rj": 2.99,
        "cw": "341/345",
        "nd": 2017,
        "jg": 12000,
        "bz": "106.25*11802,4层。南面为剧院。三室两厅两卫，19年6月交房(北侧有陵园)"
    },
    // E
    // F
    // G
    // H
    {
        "wz": "113.546644,34.82458",
        "mc": "翰林国际城（高新区）",
        "hx": 1234,
        "zx": 0,
        "rj": 3.50,
        "cw": "1000/4000",
        "nd": 2017,
        "jg": 14000,
        "bz": "翰林国际城在售住宅房源均价约14000元/平米，房源建面约91-159平米。在售建面约25-32平米非毛坯平层公寓，均价约9500元/平米。在售商铺建面约30-200平米，均价约21000元/平米。"
    },
    {
        "wz": "113.651453,34.843172",
        "mc": "瀚宇天悦（金水区）",
        "hx": 12345,
        "zx": 0,
        "rj": 3.00,
        "cw": "0/1712",
        "nd": 2017,
        "jg": 15000,
        "bz": "瀚宇天悦，加推房源已经开盘，本次推出二期5#楼，总高24层，两个单元分为2梯3户、2梯4户，建面约88-89平米两房、119-122平米三房、134平米3+1房，成交均价15000元/平米（毛坯）"
    },
    {
        "wz": "113.544635,34.762462",
        "mc": "华瑞紫韵城（中原区）",
        "hx": 234,
        "zx": 0,
        "rj": 4.20,
        "cw": "12000/3320",
        "nd": 2017,
        "jg": 13000,
        "bz": "整体均价约13000元/㎡，在售房源建面约75-143㎡，星园预计2020年上半年交房。"
    },
    {
        "wz": "113.524067,34.72578",
        "mc": "汇泉西悦城（中原区）",
        "hx": 234,
        "zx": 0,
        "rj": 3.10,
        "cw": "3143/2673",
        "nd": 2018,
        "jg": 11800,
        "bz": "三期2# 三期3# 三期5# 三期7#预售，预计2020年9月三期1#、三期3#、三期6#交房\n目前在售洋房和高层房源，洋房均价约15000元/㎡，建面约为111平和113.31平的三房；高层房源整体均价为11800元/平，建面约为77.9、89、108、129平。"
    },
    // I
    // J
    {
        "wz": "113.575863,34.803978",
        "mc": "金科城（高新区）",
        "hx": 234,
        "zx": 1,
        "rj": 3.11,
        "cw": "7845/7030",
        "nd": 2017,
        "jg": 16000,
        "bz": "预计2019年年底二期3、10、16号楼交房"
    },
    {
        "wz": "113.757933,34.691714",
        "mc": "金沙湖高尔夫观邸（经开区）",
        "hx": 234,
        "zx": 0,
        "rj": 2.77,
        "cw": "4724/4735",
        "nd": 2015,
        "jg": 16000,
        "bz": "经开区，没有小户型，单价15000+"
    },
    {
        "wz": "113.64968,34.850563",
        "mc": "锦艺金水湾（金水区）",
        "hx": 34,
        "zx": 0,
        "rj": 3.50,
        "cw": "19044/3268",
        "nd": 2017,
        "jg": 14000,
        "bz": "三期预计推出建面约80-140平米房源，预计1月下旬推出，预计均价在14000元/平米。"
    },
    {
        "wz": "113.601999,34.772283",
        "mc": "九龙城（中原区）",
        "hx": 1234,
        "zx": 1,
        "rj": 4.43,
        "cw": "19044/1892",
        "nd": 2017,
        "jg": 13500,
        "bz": "精装15800，毛坯15300只有一二层，7#精装年后开盘16400左右，首付分期(1+4次:每半年10W);精装19年年底交房，毛坯9月份交房\n在售房源建面约84-148平，整体均价13250元/平，预计2019年9月份交房。"
    },
    {
        "wz": "113.860586,34.68596",
        "mc": "九龙新城（经开区）",
        "hx": 234,
        "zx": 1,
        "rj": 3.50,
        "cw": "1868/1571",
        "nd": 2017,
        "jg": 11500,
        "bz": "11586.26*124.15，地铁14号线，2T4H，首付分期。特惠价10700首付30%。"
    },
    // K
    {
        "wz": "113.810067,34.67789",
        "mc": "康桥悦蓉园（经开区）",
        "hx": 234,
        "zx": 1,
        "rj": 2.50,
        "cw": "0/1900",
        "nd": 2017,
        "jg": 17300,
        "bz": ""
    },
    // L
    {
        "wz": "113.620855,34.814501",
        "mc": "绿地璀璨星座（惠济区）",
        "hx": 234,
        "zx": 1,
        "rj": 5.37,
        "cw": "1804/3285",
        "nd": 2017,
        "jg": 14500,
        "bz": ""
    },
    {
        "wz": "113.684351,34.683322",
        "mc": "绿都澜湾（管城区）",
        "hx": 234,
        "zx": 0,
        "rj": 3.49,
        "cw": "25265/16711",
        "nd": 2017,
        "jg": 13400,
        "bz": "四期7#8#预计2020年交房。[体量很大，有16000多户，容积率有3.49，分五期开发；\n项目离地铁口有一定距离，澜湾售楼部是在宇通路和紫荆山南路的交叉口，但是物业地址并不是那么回事儿]\n[绿都澜湾四期椿园房子，感觉还不错，刚需嘛没啥要求，就是看规划图发现有个问题，想请教下，麻烦请问下绿都澜湾四期的椿园，在规划东南角有个110KV变电站]\n四期椿园，89*13500(B1户型)，套内约70，3号楼6号楼缴费2万排号，3月中下旬选房，7#8#卖完。1#2#5#未开卖。3#东单元(一单元)30层2T4H，西单元26层2T5H，[2号线站马屯站，旁边]"
    },
    {
        "wz": "113.686464,34.697352",
        "mc": "绿都紫荆华庭（管城区）",
        "hx": 134,
        "zx": 0,
        "rj": 3.49,
        "cw": "1500/1500",
        "nd": 2017,
        "jg": 12800,
        "bz": "只有124房源"
    },
    // M
    {
        "wz": "113.644271,34.859874",
        "mc": "美景麟起城（惠济区）",
        "hx": 1234,
        "zx": 1,
        "rj": 3.70,
        "cw": "0/3835",
        "nd": 2018,
        "jg": 16000,
        "bz": ""
    },
    // N
    // O
    // P
    // Q
    {
        "wz": "113.621017,34.802846",
        "mc": "谦祥福晟兴隆城（惠济区）",
        "hx": 23,
        "zx": 0,
        "rj": 4.49,
        "cw": "2707/6681",
        "nd": 0,
        "jg": 15000,
        "bz": "[3号线兴隆铺路站1km]首付分期(10%+5%+5%+10%)，外国语学区房"
    },
    {
        "wz": "113.539016,34.833087",
        "mc": "谦祥万和城（高新区）",
        "hx": 1234,
        "zx": 0,
        "rj": 3.50,
        "cw": "2040/4021",
        "nd": 0,
        "jg": 14000,
        "bz": "公寓：项目建设有30栋商品房，34层高层 。其余为安置房。"
    },
    // R
    {
        "wz": "113.903949,34.77555",
        "mc": "融创美盛象湖壹号（郑东新区）",
        "hx": 3,
        "zx": 0,
        "rj": 3.49,
        "cw": "0/1524",
        "nd": 2016,
        "jg": 11000,
        "bz": ""
    },
    {
        "wz": "113.527589,34.790882",
        "mc": "荣盛祝福花语水岸（高新区）",
        "hx": 234,
        "zx": 1,
        "rj": 3.49,
        "cw": "4121/2505",
        "nd": 0,
        "jg": 13500,
        "bz": "预计2020年12月底交房，目前在售8#、9#、11#、12#、15#、16#建面约72-133平米房源，整体均价为13500元/平米，具体一房一价，详情以售楼处为准。"
    },
    // S
    {
        "wz": "113.622991,34.777716",
        "mc": "升龙天汇广场（中原区）[陈凯]",
        "hx": 1234,
        "zx": 0,
        "rj": 4.99,
        "cw": "1038/2802",
        "nd": 2018,
        "jg": 15200,
        "bz": "7号院3号楼即将推出，预计推出建面约71-89㎡住宅房源。项目目前在售84-145㎡高层房源，均价14500元/㎡。"
    },
    {
        "wz": "113.599542,34.727754",
        "mc": "盛世卧龙城（中原区）",
        "hx": 234,
        "zx": 0,
        "rj": 4.45,
        "cw": "4452/3398",
        "nd": 2017,
        "jg": 13500,
        "bz": "87*13600，两室两厅一卫，6号线，共34层(东单元西南户22层，)，小区前面为安置房。19年年底交房"
    },
    // T
    {
        "wz": "113.640196,34.682858",
        "mc": "泰宏建业国际城（二七区）",
        "hx": 0,
        "zx": 0,
        "rj": 3.50,
        "cw": "2543/2543",
        "nd": 2016,
        "jg": 13200,
        "bz": "117*13000售完，3月底新开"
    },
    {
        "wz": "113.629531,34.803158",
        "mc": "台隆合园（惠济区）",
        "hx": 234,
        "zx": 0,
        "rj": 3.49,
        "cw": "0/2360",
        "nd": 2017,
        "jg": 14500,
        "bz": "预计2019年一期下半年交房"
    },
    {
        "wz": "113.78869,34.693248",
        "mc": "拓丰·祥和居（经开区）",
        "hx": 0,
        "zx": 0,
        "rj": 0,
        "cw": "0/0",
        "nd": 2017,
        "jg": 13500,
        "bz": "90*13500两室两厅一卫，2号院3#15层，2018年底交房。"
    },
    // U
    // V
    // W
    {
        "wz": "113.986789,34.760991",
        "mc": "万科·荣成兰乔圣菲（中牟县）",
        "hx": 345,
        "zx": 0,
        "rj": 1.20,
        "cw": "1480/730",
        "nd": 2017,
        "jg": 10000,
        "bz": "院墅4层，高层18-20层、商业街3层"
    },
    {
        "wz": "113.518215,34.812689",
        "mc": "万科城（高新区）",
        "hx": 123,
        "zx": 1,
        "rj": 2.80,
        "cw": "2783/2985",
        "nd": 2017,
        "jg": 13500,
        "bz": "万科城在售五期住宅，均价约为13500元/平，房源建面约77-108平米，具体一房一价。"
    },
    {
        "wz": "113.645756,34.65881",
        "mc": "万科大都会（二七区）",
        "hx": 234,
        "zx": 1,
        "rj": 2.99,
        "cw": "0/4232",
        "nd": 2017,
        "jg": 13500,
        "bz": "非毛坯住宅房源在售，房源建面约77-130平米，均价约13500元/平米，按揭优惠2.2%，再减10000元，全款在按揭优惠的基础上再优惠1个点，详情咨询售楼部。"
    },
    {
        "wz": "113.592334,34.759204",
        "mc": "五建新街坊（中原区）",
        "hx": 234,
        "zx": 0,
        "rj": 4.66,
        "cw": "1789/4780",
        "nd": 2017,
        "jg": 15000,
        "bz": "88.18* 15491 ，总价1339542，2403共34层。西单元。套内66.82，公摊21.36。互助路小学学区。市重点。门前建设路一号线西三环。"
    },
    // X
    {
        "wz": "113.641253,34.66025",
        "mc": "鑫苑二七鑫中心（二七区）",
        "hx": 123,
        "zx": 0,
        "rj": 2.90,
        "cw": "0/3920",
        "nd": 2017,
        "jg": 12000,
        "bz": "预计2019年3月底三期4、5、6号楼交房"
    },
    {
        "wz": "113.682997,34.702758",
        "mc": "鑫苑国际新城（管城区）",
        "hx": 1234,
        "zx": 0,
        "rj": 4.38,
        "cw": "0/2985",
        "nd": 2017,
        "jg": 14000,
        "bz": "该项目在售二期和三期房源，在售二期房源建面约186平米，在售三期房源建面约75、89-128、148平米，均价为14000元/平米，具体一房一价"
    },
    {
        "wz": "113.627462,34.661317",
        "mc": "旭辉正荣首府（二七区）",
        "hx": 34,
        "zx": 1,
        "rj": 2.49,
        "cw": "1556/1515",
        "nd": 2017,
        "jg": 13500,
        "bz": "已加推89-134平米房源，房源位于9#、11#、14#，有三房和四房，均价约13500元/平米，交房时间约在2020年3月份"
    },
    // Y
    {
        "wz": "113.585574,34.743753",
        "mc": "阳光城丽景公馆（中原区）",
        "hx": 123,
        "zx": 1,
        "rj": 5.86,
        "cw": "2995/3340",
        "nd": 2017,
        "jg": 16000,
        "bz": "88*16000精装修，[地铁10号线]，19年底交房，学区房:互助路小学市重点。(员工通道5.1前付清首付)紧邻三环高架，需考虑晚上噪音"
    },
    {
        "wz": "113.635175,34.781735",
        "mc": "亚新美好城邦（金水区）",
        "hx": 234,
        "zx": 1,
        "rj": 3.49,
        "cw": "1922/1677",
        "nd": 2017,
        "jg": 18500,
        "bz": "88平精装两房，学区房"
    },
    {
        "wz": "113.624337,34.684573",
        "mc": "亚星锦绣山河（二七区）",
        "hx": 123,
        "zx": 0,
        "rj": 3.50,
        "cw": "0/1013",
        "nd": 2017,
        "jg": 12000,
        "bz": "目前有公寓房源在售，其中平层公寓均价12000元/平，建面约34-63平，LOFT公寓均价12500元/平，建面约50-85平，具体一房一价，售楼处有优惠，详情咨询售楼部。\n预计2018年年底8号地块东、西塔；10号地块交房。"
    },
    {
        "wz": "113.629973,34.696536",
        "mc": "亚星云水居（二七区）",
        "hx": 345,
        "zx": 0,
        "rj": 4.49,
        "cw": "1627/1717",
        "nd": 2017,
        "jg": 14000,
        "bz": "102*14000两房，1#共30层，19年9月交房。华中师范大学附属亚星实验学校，私立。有一个7.9平的需要自己浇筑顶。套内77.88"
    },
    {
        "wz": "113.696815,34.689741",
        "mc": "永威城（管城区）",
        "hx": 234,
        "zx": 0,
        "rj": 3.47,
        "cw": "1242/4938",
        "nd": 2017,
        "jg": 13800,
        "bz": "观澜亭，88*13900，共34层，1#3#此户型剩余不好楼层，8#年后开盘，车位1:1.07(地下二三层，一层非机动车夹层)，[周边地铁较远。]\n目前有三期和四期高层在售，建面约88-166平米，均价为13800元/平米，具体一房一价，详情以售楼处为准"
    },
    {
        "wz": "113.845053,34.583527",
        "mc": "豫发白鹭源春晓（航空港区）",
        "hx": 234,
        "zx": 0,
        "rj": 2.88,
        "cw": "1242/1214",
        "nd": 2017,
        "jg": 10000,
        "bz": "在售两房、三房和四房房源，建筑面积约70-148平米，均为18层小高层住宅，成交价格区间9500-10300元/平米，整体均价10000元/平米（毛坯），具体一房一价。"
    },
    // Z
    {
        "wz": "113.63055,34.676504",
        "mc": "招商天地华府（二七区）",
        "hx": 234,
        "zx": 1,
        "rj": 2.99,
        "cw": "3430/3529",
        "nd": 2016,
        "jg": 13500,
        "bz": "87*13700精装，19年底交房，9号线。套内63平，13#5层，南边为6层私立学校(小学，中学)。(西侧与陵园相隔嵩山南路)"
    },
    {
        "wz": "113.697761,34.694453",
        "mc": "正商中州城（管城区）",
        "hx": 23,
        "zx": 0,
        "rj": 3.45,
        "cw": "2540/1435",
        "nd": 2017,
        "jg": 13500,
        "bz": "4#20F03户，125.95*13319,首付分期(首期6W，余款每半年一次，4次还清)，车位13.1W地下二三层，2020年初交房"
    },
    {
        "wz": "113.695758,34.644163",
        "mc": "正商智慧城（新郑市）",
        "hx": 34,
        "zx": 0,
        "rj": 3.45,
        "cw": "5000/5000",
        "nd": 2017,
        "jg": 10000,
        "bz": "115*9700，31#16F，2T4H，1W定金3天内交首付，2020年底交房。[9号线十八里河站，较远]车位12-13W。89*10500售罄。"
    },
    {
        "wz": "113.576404,34.829182",
        "mc": "郑州恒大城（高新区）",
        "hx": 234,
        "zx": 1,
        "rj": 3.09,
        "cw": "1211/1147",
        "nd": 2017,
        "jg": 16000,
        "bz": ""
    },
    {
        "wz": "113.736401,35.002901",
        "mc": "中昂朗悦（其他）",
        "hx": 234,
        "zx": 1,
        "rj": 1.80,
        "cw": "1672/1112",
        "nd": 2018,
        "jg": 10500,
        "bz": "预计2019年年底一期7#、8#、18#交房"
    },
    {
        "wz": "113.726497,34.686469",
        "mc": "中岳俪景湾（管城区）",
        "hx": 23,
        "zx": 0,
        "rj": 3.50,
        "cw": "981/984",
        "nd": 2017,
        "jg": 13800,
        "bz": "88*14100，3#10F共34层，2T4H，2W抵4W，首付分期(15%，4%，4%，4%，3%)，[4号线星火路站800m，20年底开通]，车位1:1，2019年底交房。缺少学校，医疗，公园，商场。附近物流园和厂区，17年7月12000"
    }
];


/**
 * http://lbs.amap.com/console/show/picker
 */
var EDGE_W = 113.947000; // 经度
var EDGE_E = 114.124500; // 经度
var EDGE_S = 33.536000; // 纬度
var EDGE_N = 33.618000; // 纬度

/**
 * 郑州环城路
 */
var arrayZhengzhouEdge = [
    [EDGE_W, EDGE_N], // 左上
    [EDGE_E, EDGE_N], // 右上
    [EDGE_E, EDGE_S], // 右下
    [EDGE_W, EDGE_S], // 左下
    [EDGE_W, EDGE_N]  // 左上
];

/**
 * 一号线
 * @type {[*]}
 */
var arraySubway01 = [
    [113.542069, 34.826573], // 河南工业大学
    [113.541812, 34.816778], // 郑大科技园
    [113.541431, 34.807587], // 郑州大学
    [113.540879, 34.794425], // 梧桐街
    [113.541007, 34.783446], // 兰寨
    [113.540747, 34.768136], // 铁炉
    [113.553922, 34.762068], // 市民中心
    [113.570155, 34.761138], // 西流湖
    [113.588179, 34.760212], // 西三环
    [113.603285, 34.756793], // 秦岭路
    [113.614293, 34.755806], // 五一公园
    [113.624271, 34.755066], // 碧沙岗
    [113.633519, 34.747485], // 绿城广场
    [113.642574, 34.747555], // 医学院
    [113.656157, 34.746709], // 郑州火车站
    [113.665834, 34.752523], // 二七广场
    [113.673865, 34.757573], // 人民路
    [113.682051, 34.762183], // 紫荆山
    [113.703396, 34.763386], // 燕庄
    [113.715825, 34.763951], // 民航路
    [113.725744, 34.766731], // 会展中心
    [113.744514, 34.762888], // 黄河南路
    [113.755313, 34.765431], // 农业南路
    [113.766626, 34.764418], // 东风南路
    [113.777012, 34.759253], // 郑州东站
    [113.792537, 34.759967], // 博学路
    [113.810404, 34.773134], // 市体育中心
    [113.810499, 34.792727], // 龙子湖
    [113.812188, 34.808444], // 文苑北路
    [113.812639, 34.820661] // 河南大学新区(暂缓开通)
]


/**
 * 二号线
 * @type {[*]}
 */
var arraySubway02 = [

]
